#+OPTIONS: _:nil ^:nil

*** groups
#+BEGIN: aggregate :table "swda" :cols "group sum(total)"
| group                            | sum(total) |   |   |       |
|----------------------------------+------------+---+---+-------|
| Forward-Communicative-Function   |     114924 |   |   | 51.86 |
| Backwards-Communicative-Function |      67259 |   |   | 30.35 |
| Other                            |      20033 |   |   |  9.04 |
| Communicative-Status             |      19400 |   |   |  8.75 |
#+TBLFM: $5=$2*100/vsum(@2$2..@5$2);f2
#+END:


#+BEGIN: aggregate :table "swda" :cols "group (sum(lassoc)*100/sum(total));f2 (sum(l)*100/sum(total));f2 (vmean(accL)-vmean(accNL))*100;f2"
| group                            | (sum(lassoc)*100/sum(total));f2 | (sum(l)*100/sum(total));f2 | (vmean(accL)-vmean(accNL))*100;f2 |
|----------------------------------+---------------------------------+----------------------------+-----------------------------------|
| Forward-Communicative-Function   |                           11.86 |                       4.59 |                             11.40 |
| Backwards-Communicative-Function |                           11.57 |                       3.03 |                              4.30 |
| Other                            |                           12.71 |                       4.40 |                              2.39 |
| Communicative-Status             |                           20.63 |                      14.17 |                             -1.50 |
#+END:

#+TBLFM: $5=$2/vsum(@2$2..@5$2)::$6=$3/$2::$7=$4/$2


*** groups
#+BEGIN: aggregate :table "ami-da" :cols "group sum(total)"
| group                            | sum(total) |   |   |       |
|----------------------------------+------------+---+---+-------|
| Forward-Communicative-Function   |      51639 |   |   | 43.79 |
| Backwards-Communicative-Function |      38789 |   |   | 32.90 |
| Other                            |      27487 |   |   | 23.31 |
#+TBLFM: $5=$2*100/vsum(@2$2..@4$2);f2
#+END:

** filter
#+NAME: my-filter
#+BEGIN_SRC elisp :var tbl=swda :colnames no :hline no
  (cl-loop for row in tbl
           if (not (equal (nth 0 row) "x"))
               collect row into newtbl
               finally return newtbl)
#+END_SRC

#+RESULTS: my-filter
| sd              | Statement-non-opinion                     | 75143 | 0.3390685 | 9032 | 0.1201975 | 0 | 0.0 | 3442 |  0.045806 | 0 | 0.0 | 0.8938315 | 0.8404784 |
| b               | Acknowledge (Backchannel)                 | 38298 | 0.1728124 | 3787 | 0.0988824 | 0 | 0.0 |  755 | 0.0197138 | 0 | 0.0 | 0.9289026 | 0.9388202 |
| sv              | Statement-opinion                         | 26426 | 0.1192423 | 2960 | 0.1120109 | 0 | 0.0 | 1249 | 0.0472641 | 0 | 0.0 | 0.5619559 |  0.657344 |
| +               | Segment (multi-utterance)                 | 17824 | 0.0804274 | 2195 | 0.1231486 | 0 | 0.0 |  754 | 0.0423025 | 0 | 0.0 | 0.7611189 | 0.8344056 |
| %               | Abandoned or Turn-Exit or Uninterpretable | 15550 | 0.0701664 | 1506 | 0.0968489 | 0 | 0.0 |  364 | 0.0234084 | 0 | 0.0 | 0.7731362 | 0.8316195 |
| aa              | Agree/Accept                              | 11133 | 0.0502355 | 1596 | 0.1433576 | 0 | 0.0 |  426 | 0.0382646 | 0 | 0.0 | 0.4432342 | 0.4139087 |
| ba              | Appreciation                              |  4764 | 0.0214966 |  868 | 0.1821998 | 0 | 0.0 |  329 | 0.0690596 | 0 | 0.0 | 0.6634304 | 0.7216828 |
| qy              | Yes-No-Question                           |  4726 | 0.0213252 |  539 | 0.1140499 | 0 | 0.0 |  167 | 0.0353364 | 0 | 0.0 | 0.8310502 | 0.8401826 |
| ny              | Yes answers                               |  3034 | 0.0136903 |  269 | 0.0886618 | 0 | 0.0 |   65 | 0.0214239 | 0 | 0.0 | 0.7107143 | 0.6964286 |
| fc              | Conventional-closing                      |  2582 | 0.0116508 |  247 | 0.0956623 | 0 | 0.0 |   87 | 0.0336948 | 0 | 0.0 | 0.7051724 | 0.6982759 |
| qw              | Wh-Question                               |  1979 | 0.0089299 |  241 | 0.1217787 | 0 | 0.0 |   62 |  0.031329 | 0 | 0.0 | 0.8421053 | 0.9362881 |
| nn              | No answers                                |  1377 | 0.0062135 |  137 | 0.0994916 | 0 | 0.0 |   36 | 0.0261438 | 0 | 0.0 | 0.8901961 | 0.8666667 |
| bk              | Response Acknowledgement                  |  1306 | 0.0058931 |  145 |  0.111026 | 0 | 0.0 |   41 | 0.0313936 | 0 | 0.0 | 0.4256198 | 0.5041322 |
| h               | Hedge                                     |  1226 | 0.0055321 |  157 | 0.1280587 | 0 | 0.0 |   50 |  0.040783 | 0 | 0.0 | 0.7478261 | 0.7434783 |
| qy^d            | Declarative Yes-No-Question               |  1218 |  0.005496 |  146 | 0.1198686 | 0 | 0.0 |   64 | 0.0525452 | 0 | 0.0 | 0.0979592 | 0.0897959 |
| bh              | Backchannel in question form              |  1053 | 0.0047515 |  130 | 0.1234568 | 0 | 0.0 |   29 | 0.0275404 | 0 | 0.0 | 0.8552036 |  0.678733 |
| ^q              | Quotation                                 |   983 | 0.0044356 |  195 | 0.1983723 | 0 | 0.0 |   78 | 0.0793489 | 0 | 0.0 | 0.1407767 |       0.0 |
| bf              | Summarize/reformulate                     |   952 | 0.0042957 |  139 | 0.1460084 | 0 | 0.0 |   76 | 0.0798319 | 0 | 0.0 | 0.0174419 |       0.0 |
| fo_o_fw_"_by_bc | Other                                     |   883 | 0.0039844 |  102 | 0.1155153 | 0 | 0.0 |   39 | 0.0441676 | 0 | 0.0 | 0.5384615 | 0.5502959 |
| na              | Affirmative non-yes answers               |   847 | 0.0038219 |  125 | 0.1475797 | 0 | 0.0 |   49 | 0.0578512 | 0 | 0.0 | 0.2777778 | 0.2469136 |
| ad              | Action-directive                          |   746 | 0.0033662 |  150 | 0.2010724 | 0 | 0.0 |   70 | 0.0938338 | 0 | 0.0 | 0.3492063 | 0.2698413 |
| ^2              | Collaborative Completion                  |   723 | 0.0032624 |   95 |  0.131397 | 0 | 0.0 |   44 | 0.0608575 | 0 | 0.0 | 0.1764706 | 0.0514706 |
| b^m             | Repeat-phrase                             |   688 | 0.0031045 |   77 | 0.1119186 | 0 | 0.0 |   30 | 0.0436047 | 0 | 0.0 | 0.0503145 | 0.1194969 |
| qo              | Open-Question                             |   656 | 0.0029601 |   92 | 0.1402439 | 0 | 0.0 |   30 | 0.0457317 | 0 | 0.0 | 0.7185185 | 0.6222222 |
| qh              | Rhetorical-Questions                      |   575 | 0.0025946 |   97 | 0.1686957 | 0 | 0.0 |   52 | 0.0904348 | 0 | 0.0 |  0.259542 | 0.0763359 |
| ^h              | Hold before answer/agreement              |   556 | 0.0025088 |   70 | 0.1258993 | 0 | 0.0 |   19 | 0.0341727 | 0 | 0.0 | 0.3194444 | 0.4583333 |
| ar              | Reject                                    |   345 | 0.0015567 |   51 | 0.1478261 | 0 | 0.0 |   23 | 0.0666667 | 0 | 0.0 | 0.0441176 |       0.0 |
| ng              | Negative non-no answers                   |   302 | 0.0013627 |   34 | 0.1125828 | 0 | 0.0 |   16 | 0.0529801 | 0 | 0.0 | 0.1515152 | 0.1515152 |
| br              | Signal-non-understanding                  |   298 | 0.0013447 |   30 | 0.1006711 | 0 | 0.0 |    4 | 0.0134228 | 0 | 0.0 | 0.4772727 | 0.0227273 |
| no              | Other answers                             |   285 |  0.001286 |   34 | 0.1192982 | 0 | 0.0 |   14 | 0.0491228 | 0 | 0.0 | 0.3103448 |       0.0 |
| fp              | Conventional-opening                      |   225 | 0.0010153 |   22 | 0.0977778 | 0 | 0.0 |   10 | 0.0444444 | 0 | 0.0 | 0.7681159 | 0.4927536 |
| qrr             | Or-Clause                                 |   209 | 0.0009431 |    8 | 0.0382775 | 0 | 0.0 |    1 | 0.0047847 | 0 | 0.0 | 0.6046512 | 0.4651163 |
| arp_nd          | Dispreferred answers                      |   207 |  0.000934 |   37 |  0.178744 | 0 | 0.0 |   19 | 0.0917874 | 0 | 0.0 |       0.0 |       0.0 |
| t3              | 3rd-party-talk                            |   117 | 0.0005279 |   15 | 0.1282051 | 0 | 0.0 |    1 |  0.008547 | 0 | 0.0 |       0.0 |       0.0 |
| oo_co_cc        | Offers, Options Commits                   |   110 | 0.0004964 |   28 | 0.2545455 | 0 | 0.0 |   10 | 0.0909091 | 0 | 0.0 |       0.0 |       0.0 |
| aap_am          | Maybe/Accept-part                         |   105 | 0.0004738 |   19 | 0.1809524 | 0 | 0.0 |    6 | 0.0571429 | 0 | 0.0 |       0.0 |       0.0 |
| bd              | Downplayer                                |   103 | 0.0004648 |   39 | 0.3786408 | 0 | 0.0 |   17 | 0.1650485 | 0 | 0.0 |       0.0 |       0.0 |
| t1              | Self-talk                                 |   103 | 0.0004648 |   16 | 0.1553398 | 0 | 0.0 |    3 | 0.0291262 | 0 | 0.0 |       0.0 |       0.0 |
| ^g              | Tag-Question                              |    92 | 0.0004151 |   15 | 0.1630435 | 0 | 0.0 |    6 | 0.0652174 | 0 | 0.0 |    0.0625 |       0.0 |
| qw^d            | Declarative Wh-Question                   |    80 |  0.000361 |   14 |     0.175 | 0 | 0.0 |    4 |      0.05 | 0 | 0.0 |       0.0 |       0.0 |
| fa              | Apology                                   |    79 | 0.0003565 |   24 | 0.3037975 | 0 | 0.0 |   10 | 0.1265823 | 0 | 0.0 |      0.75 |       0.0 |
| ft              | Thanking                                  |    78 |  0.000352 |   14 | 0.1794872 | 0 | 0.0 |    9 | 0.1153846 | 0 | 0.0 | 0.3684211 |       0.0 |
|                 |                                           |       |           |      |           |   |     |      |           |   |     |           |           |
